# Бот создан прораммистом Владиславом Тёровым by delight Bots
# Copyright 2022 Все права защищены
# deLight Bots оставляет за собой авторское право на созданные продукты

# API Token
TG_TOKEN = "5132405336:AAEVIun-vsXB_JbNw3JfiFxlrF-7-nEjpLQ"

# Стили
style1 = '🕺🏻 Фигурное катание'
style2 = '🛷 Бобслей'
style3 = '🎿 Биатлон'
style4 = '🥌 Кёрлинг'
style5 = '⛸ Шорт трек'
style6 = '🏒 Хоккей'
style7 = '🏂 Сноуборд'

# Команды
command_cat = '!'
command_name = 'От: '
command = 'start'
watermark = '\n\n❗ Тестовый образец ❗\ndeLight Bots 2022'
# Фразы бота
dialog1 = "Напиши имя того, кого хочешь поздравить.\n(Или как ты к нему обращаешься: муж, брат, господин президент и пр.)" + watermark
dialog2 = "Давай пожелаем мирных побед!\nЕсли бы он занимался спортом, в каком виде взял бы медаль?" + watermark
dialog3 = "Скоро все будет готово!\nПоследний вопрос: как подпишем открытку?\nНапиши, как тебя зовут (или как тебя называют)" + watermark
dialog4 = 'Сохрани эту картинку и отправь в любом мессенджере или распечатай!' + watermark
dialog5 = 'Сделаем еще поздравление?' + watermark
dialog6 = 'Ладно, если захочешь сделать поздравление снова, то просто введи /start или выбери нужный пункт меню' + watermark
# Фоновые изображения
start_image = 'images/приветствие с текстом.jpg'
not_image = 'images/перебивка.jpg'

# Бот создан прораммистом Владиславом Тёровым by delight Bots
# Copyright 2022 Все права защищены
# deLight Bots оставляет за собой авторское право на созданные продукты

image1 = 'images/фигурное катание.jpg'
image2 = 'images/бобслей.jpg'
image3 = 'images/биатлон.jpg'
image4 = 'images/керлинг.jpg'
image5 = 'images/шорт трек.jpg'
image6 = 'images/хоккей.jpg'
image7 = 'images/сноуборд.jpg'

# Созданная открытка
end_image = 'postcard.jpg'

text_btn2 = 'Не сейчас'
text_btn1 = 'ДА!'


# Шрифты
font1 = 'Montserrat-Bold.ttf'
font3 = 'Montserrat-Bold.ttf'

# Цвет текста
text_color_1 = '#000000'
text_color_3 = '#000000'

# Размер текста
font_size_1 = 55
font_size_3 = 50

# Бот создан прораммистом Владиславом Тёровым by delight Bots
# Copyright 2022 Все права защищены
# deLight Bots оставляет за собой авторское право на созданные продукты

# Расположение текста
# 1
text_11_loc_a = 540
text_11_loc_b = 645
text_13_loc_a = 540
text_13_loc_b = 1400
# 2
text_21_loc_a = 540
text_21_loc_b = 645
text_23_loc_a = 540
text_23_loc_b = 1400
# 3
text_31_loc_a = 540
text_31_loc_b = 645
text_33_loc_a = 540
text_33_loc_b = 1400
# 4
text_41_loc_a = 540
text_41_loc_b = 645
text_43_loc_a = 540
text_43_loc_b = 1400
# 5
text_51_loc_a = 540
text_51_loc_b = 645
text_53_loc_a = 540
text_53_loc_b = 1400
# 6
text_61_loc_a = 540
text_61_loc_b = 645
text_63_loc_a = 540
text_63_loc_b = 1400
# 7
text_71_loc_a = 540
text_71_loc_b = 645
text_73_loc_a = 540
text_73_loc_b = 1400

# Бот создан прораммистом Владиславом Тёровым by delight Bots
# Copyright 2022 Все права защищены
# deLight Bots оставляет за собой авторское право на созданные продукты
